GetCropRegionShapeManagerForReferenceCallout Method
 Returns an object for managing view crop region shape for reference callout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static ViewCropRegionShapeManager GetCropRegionShapeManagerForReferenceCallout(
	Document doc,
	ElementId callout
)
Visual Basic
Public Shared Function GetCropRegionShapeManagerForReferenceCallout ( _
	doc As Document, _
	callout As ElementId _
) As ViewCropRegionShapeManager
Visual C++
public:
static ViewCropRegionShapeManager^ GetCropRegionShapeManagerForReferenceCallout(
	Document^ doc,
	ElementId^ callout
)
Parameters
doc
Type: Autodesk.Revit.DBDocument
 Document to which the callout belongs.
callout
Type: Autodesk.Revit.DBElementId
 Element id of reference callout.
Return Value
 The crop region shape manager.
Remarks
 Reference callout is a view-specific element referencing another view. It can have its own crop region shape which doesn't affect the referenced view.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →